app/views/pins/_form.erb

          <label for="pin_category_id" class="control-label  col-sm-offset-2 col-sm-2">Category</label>
            <%= f.collection_select(:category_id, Category.all, :id, :name) %>
---
SELECT "categories".* FROM "categories"