app/controllers/boards_controller.rb

  def show
    @board = current_user.boards.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."user_id" = $1 AND "boards"."id" = $2 LIMIT 1  [["user_id", 5], ["id", 5]]

  def edit
    @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 24]]

  def create
    @board = Board.new(board_params)

    respond_to do |format|
      if @board.save
---
INSERT INTO "boards" ("name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Hockey"], ["user_id", 5], ["created_at", "2016-10-04 21:17:04.114746"], ["updated_at", "2016-10-04 21:17:04.114746"]]

  def update
    respond_to do |format|
      if @board.update(board_params)
---
UPDATE "boards" SET "name" = $1, "updated_at" = $2 WHERE "boards"."id" = $3  [["name", "Wish List"], ["updated_at", "2016-10-11 15:27:17.337629"], ["id", 18]]

    def set_board
      @board = Board.find(params[:id])
---
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 24]]