app/controllers/pins_controller.rb

  def index
    @pins = Pin.all
---
SELECT "pins".* FROM "pins" WHERE (4)

  def show_by_name
    @pin = Pin.find_by_slug(params[:slug])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."slug" = $1 LIMIT 1  [["slug", "my home page"]]

  def create
    @pin = Pin.create(pin_params)
---
INSERT INTO "pins" ("title", "url", "slug", "text", "category_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Pelham Library"], ["url", "http://www.pelhamlibrary.on.ca/"], ["slug", "Pelham Library"], ["text", "Library in Fenwick, Ontari0"], ["category_id", 1]]

  def edit

    @pin = Pin.find(params[:id])
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    @pin = Pin.find(params[:id])

    #super complicated useless setup!!!
     #@pin.pinnings.find_by(params[board_id: @user.boards, user_id: @user.id]).update_attribute(:board_id, params[:pin][:pinning][:board_id])

     #another version:
     #@pin = Pin.update(params[:id], pin_params)

     #Pin.update returns the resulting object whether it was saved successfully to the database or not. Therefore, Pin.update(@pin.id, pin_params) does not update the @pin variable if you do not make the assignment; @pin=Pin.update(.....).
     # @pin.update_attributes(pin_params) does change the @pin variable implicitly.
     #The solution for this to work with the update method is to do @pin = Pin.update(@pin.id, pin_params)
#require 'byebug'
#debugger
    if @pin.update_attributes(pin_params)
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 7]]
UPDATE "pins" SET "text" = $1, "user_id" = $2 WHERE "pins"."id" = $3  [["text", "The Ruby Primer is a free interactive book that helps you learn Ruby. Discover Ruby idioms, learn     lessons and solve problems, all in your browser!"], ["user_id", 4], ["id", 6]]

  def repin
    @pin = Pin.find(params[:id])
    board = Board.find(params[:pin][:pinning][:board_id])
    @pin.pinnings.create!(user: current_user, board: board)
---
SELECT  "pins".* FROM "pins" WHERE "pins"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "pinnings".* FROM "pinnings" WHERE "pinnings"."pin_id" = $1  [["pin_id", 1]]
INSERT INTO "pinnings" ("user_id", "board_id", "pin_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 4], ["board_id", 24], ["pin_id", 17], ["created_at", "2016-10-10 21:03:22.809440"], ["updated_at", "2016-10-10 21:03:22.809440"]]