app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "first_name" = $1, "last_name" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["first_name", "Mark"], ["last_name", "Mark"], ["password_digest", "$2a$10$GgA2zs.XVw3PHAw1Nd1NHeUEPZ6pIIKpRd0zXfzHyn5PEQKMdkmN6"], ["updated_at", "2016-09-22 18:01:00.698817"], ["id", 5]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE (id=NULL)  ORDER BY "users"."id" ASC LIMIT 1